anton-vinogradov/esp32-leshy/src/main.cpp
#elif DEMO == DEMO_DASHBOARD

#include <Preferences.h>

#include "features/wifi_scanner/HiddenRevealer.h"
#include "features/ota/OtaManager.h"
#include "features/display/img_rider.h"
#include "features/display/font_ru_small.h"
#include "features/legal/LegalText.h"
#include "core/version.h"

ScanEngine     engine;
WifiScreen     wifiScreen;
BleScreen      bleScreen;
MenuScreen     menuScreen;
Buttons        buttons;
NetManager     net;
HiddenRevealer revealer;
OtaManager     ota;
DeauthDetector detector;
StatusLeds     leds;             // the four WS2812s under the antennas — shows what the radio is doing
AirtimeMonitor airtime;          // real per-channel airtime (promiscuous) for the Channels screen
Nrf24Spectrum  nrf;              // NRF24 raw 2.4GHz spectrum sniffer
Cc1101Spectrum cc;              // CC1101 sub-GHz spectrum sniffer
PolitePortal   portal;          // Lab captive-portal demo (own-named AP, consent button)
SubCfg         subcfg;          // Sub-GHz settings captive portal

static void drawNetBadge();      // small "connected" mark in the header (defined below)
static void gotoWifi();          // (re)enter the live Wi-Fi scan
static void ensureWifiVisible(); // keep the selected scan row on screen
static int  drawWrapped(const char* s, int x, int y, int maxw, int lh, int maxlines);  // word-wrap (defined below)
static void openNetOptions();    // RIGHT on a scan row -> per-network options
static void drawNetDetails();    // details screen for the selected network

// ---- menu tree ----
enum { M_ROOT, M_WIFI, M_BLE, M_SUBGHZ, M_SETTINGS, M_LANG, M_WIFI_ADV, M_LAB, M_DEVICE, M_PORTAL, M_GEN, M_REC };
enum { F_WIFI_SCAN, F_CONN, F_HIDDEN, F_DEAUTH, F_CHANNELS, F_SPECTRUM, F_BLE_SCAN, F_SUBSPECTRUM, F_SUBGHZ_SOON, F_RECAL, F_ABOUT, F_OTA, F_LEGAL, F_LEDS, F_BACKLIGHT, F_TXPOWER, F_NOISEGEN, F_TXMODE, F_PORTAL_CFG, F_POLITE, F_SUBTX, F_SUBPOWER, F_SUBREC, F_SUBCFG, F_REC_PLAY, F_SUBHUNT, F_LANG_EN, F_LANG_RU };
static const uint8_t K_SUB = 0, K_FEAT = 1;

static const MenuItem ROOT_I[] = {
    {"Wi-Fi",       "Scan networks",            "Wi-Fi",       "Сканирование сетей",       K_SUB, M_WIFI},
    {"BLE",         "Bluetooth devices & tags", "BLE",         "Устройства и метки",       K_SUB, M_BLE},
    {"Sub-GHz",     "315/433/868 MHz radio",    "Sub-GHz",     "Радио 315/433/868 МГц",    K_SUB, M_SUBGHZ},
    {"Settings",    "Language, touch, about",   "Настройки",   "Язык, тач, о девайсе",     K_SUB, M_SETTINGS},
};
static const MenuItem WIFI_I[] = {
    {"Wi-Fi Scan",    "Signal, channel, lock", "Скан Wi-Fi",    "Сигнал, канал, шифр",   K_FEAT, F_WIFI_SCAN},
    {"Channels 2.4G", "Airtime per channel",   "Каналы 2.4ГГц", "Занятость по каналам",  K_FEAT, F_CHANNELS},
    {"Spectrum 2.4G", "Raw band waterfall (NRF24)", "Спектр 2.4ГГц", "Водопад по спектру (NRF24)", K_FEAT, F_SPECTRUM},
    {"Laboratory",    "Experimental — transmits", "Лаборатория", "Эксперименты — эфир",   K_SUB,  M_LAB},
    {"Advanced",      "Deeper Wi-Fi tools",    "Продвинутое",   "Инструменты поглубже",  K_SUB,  M_WIFI_ADV},
};
static const MenuItem WADV_I[] = {
    {"Hidden names",   "Revealed hidden SSIDs",  "Скрытые сети",  "Раскрытые имена",       K_FEAT, F_HIDDEN},
    {"Deauth monitor", "Alarm on deauth bursts", "Детектор атак", "Тревога на отключения", K_FEAT, F_DEAUTH},
    {"TX power",       "TX radiation power", "Мощность TX", "Мощность излучения", K_FEAT, F_TXPOWER},
};
static const MenuItem BLE_I[] = {
    {"BLE Scan", "Devices & trackers nearby", "Скан BLE", "Устройства и трекеры рядом", K_FEAT, F_BLE_SCAN},
};
static const MenuItem SUB_I[] = {
    {"Spectrum", "Sub-GHz waterfall (CC1101)", "Спектр", "Водопад Sub-GHz (CC1101)", K_FEAT, F_SUBSPECTRUM},
    {"Test TX",  "Transmit a test signal",     "Тест-передача", "Тестовый сигнал в эфир", K_FEAT, F_SUBTX},
    {"Rec + replay", "Record + replay your own", "Запись-повтор", "Запись/повтор своего", K_SUB, M_REC},
    {"Freq finder", "Find your signal's freq", "Частотомер", "Найти частоту сигнала", K_FEAT, F_SUBHUNT},
    {"TX power", "Sub-GHz radiation power",    "Мощность TX",   "Мощность излучения",     K_FEAT, F_SUBPOWER},
};
static const MenuItem SET_I[] = {
    {"Wi-Fi connect",   "Status, join, exit",      "Wi-Fi подключение", "Статус, вход, выход",   K_FEAT, F_CONN},
    {"Update",          "Update from GitHub",      "Обновление",        "Обновить с GitHub",     K_FEAT, F_OTA},
    {"Language",        "Interface language",      "Язык",        "Язык интерфейса",       K_SUB,  M_LANG},
    {"Device",          "LEDs, screen, touch",     "Устройство",  "LED, экран, калибровка", K_SUB,  M_DEVICE},
    {"About",           "About ESP32-Leshy",       "О девайсе",   "Об ESP32-Leshy",        K_FEAT, F_ABOUT},
    {"Responsible use", "Legal terms — read it",   "Ответственность", "Правила — прочти",  K_FEAT, F_LEGAL},
};
// Device settings — hardware knobs, split out of the main Settings list.
static const MenuItem DEV_I[] = {
    {"Status LEDs",     "Brightness / off",        "Светодиоды",  "Яркость / выкл",        K_FEAT, F_LEDS},
    {"Screen light",    "Screen brightness",       "Яркость экрана", "Подсветка дисплея",   K_FEAT, F_BACKLIGHT},
    {"Calibrate touch", "Redo screen calibration", "Калибровка",  "Перекалибровать экран", K_FEAT, F_RECAL},
};
// Laboratory — experimental tools that TRANSMIT. Under Wi-Fi (it's a 2.4 GHz lab).
static const MenuItem LAB_I[] = {
    {"Generator",       "Run + TX mode",              "Генератор",          "Запуск и режим",         K_SUB,  M_GEN},
    {"Portal",          "Setup + raise",              "Портал",             "Настроить и поднять",    K_SUB,  M_PORTAL},
};
static const MenuItem GEN_I[] = {
    {"Run",             "Transmit into channels",     "Запуск",             "Передача в каналы",      K_FEAT, F_NOISEGEN},
    {"TX mode",         "Verify / Maximum",           "Режим передачи",     "Проверка / Максимум",    K_FEAT, F_TXMODE},
};
static const MenuItem PORTAL_I[] = {
    {"Setup",           "Name the portal AP",         "Настроить",          "Задать имя точки",       K_FEAT, F_PORTAL_CFG},
    {"Raise",           "Raise it + consent page",    "Поднять",            "Поднять точку + согласие", K_FEAT, F_POLITE},
};
// Rec/Replay umbrella (Sub-GHz): capture-and-name, the saved library, and the tuning portal.
static const MenuItem REC_I[] = {
    {"Record",          "Capture, name, save",        "Запись",             "Захват, имя, сохранить", K_FEAT, F_SUBREC},
    {"Playback",        "Saved captures",             "Воспроизведение",    "Сохранённые записи",     K_FEAT, F_REC_PLAY},
    {"Settings",        "Wait, freq, threshold",      "Настройки",          "Ожидание, частота, порог", K_FEAT, F_SUBCFG},
};
static const MenuItem LANG_I[] = {
    {"English", "", "English", "", K_FEAT, F_LANG_EN},
    {"Русский", "", "Русский", "", K_FEAT, F_LANG_RU},
};
static const Menu MENUS[] = {
    {"ESP32-Leshy", "ESP32-Leshy", ROOT_I, 4},
    {"Wi-Fi",       "Wi-Fi",       WIFI_I, 5},
    {"BLE",         "BLE",         BLE_I,  1},
    {"Sub-GHz",     "Sub-GHz",     SUB_I,  5},
    {"Settings",    "Настройки",   SET_I,  6},
    {"Language",    "Язык",        LANG_I, 2},
    {"Advanced",    "Продвинутое", WADV_I, 3},
    {"Laboratory",  "Лаборатория", LAB_I,  2},
    {"Device",      "Устройство",  DEV_I,  3},
    {"Portal",      "Портал",      PORTAL_I, 2},
    {"Generator",   "Генератор",   GEN_I,  2},
    {"Rec/Replay",  "Запись-повтор", REC_I, 3},
};

// ---- navigation state ----
enum State { ST_MENU, ST_WIFI, ST_BLE, ST_INFO, ST_PROVISION, ST_CONN, ST_HIDDEN, ST_CONFIRM, ST_OPTIONS, ST_OTA, ST_DEAUTH, ST_CHANNELS, ST_SPECTRUM, ST_SUBSPECTRUM, ST_NETINFO, ST_LEGAL, ST_LANGPICK, ST_POLITE, ST_SUBTX, ST_SUBREC, ST_SUBCFG, ST_KEYBOARD, ST_REC_PLAY, ST_SUBHUNT };
static State    st = ST_MENU;
static int      menuStack[6] = { M_ROOT };   // path of open menus (for back)
static int      selStack[6]  = { 0 };        // selection per level
static int      depth = 0;
static int      off = 0;
static int      wifiSel = 0;     // selected row in the Wi-Fi scan
static WifiRow  netSel;          // network the per-network options act on
static uint32_t seenWifiGen = 0, seenBleGen = 0;
static uint32_t scanPausedAt = 0;   // when the scan was paused (net options) — long gaps invalidate the RSSI graph
static bool     touchDown = false;
static String   infoTitle, infoBody, infoNote;
static int      infoAction = -1;   // F_LEDS / F_BACKLIGHT when the info screen is an adjustable setting (SELECT cycles it in place), else -1

