anton-vinogradov/esp32-leshy/src/main.cpp
// Push the armed set to the radio (empty when TX is off, so nothing is emitted).
static void spApplyTx() { nrf.setTxWifiMask(spTxOn ? spTxMask : 0); }

// The channel axis below the plot: a tick + number per Wi-Fi channel (armed ones in
// orange-red), plus the selection caret. Redrawn on any change; touches only the strip
// under the plot, never the live waterfall above it.
static void spDrawAxis() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f), gold = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t armed = tft.color565(0xff, 0x5a, 0x32);
    const uint16_t caret = spTxOn ? armed : tft.color565(0x46, 0xd6, 0xff);   // cyan idle → red while emitting
    tft.fillRect(0, SP_Y + SP_H + 1, 240, 34, bg);                           // clear the strip (footer starts at y=301)
    fontOff();                                                               // channel numbers use the built-in font (arg 1); a loaded VLW would override it
    tft.setTextDatum(MC_DATUM);
    for (int w = 1; w <= 13; w++) {
        int sx = spNrfToX(Nrf24Spectrum::wifiCenterNrfCh(w));
        if (sx < 0 || sx >= SP_W) continue;
        int x = SP_X + sx;
        bool major = (w == 1 || w == 6 || w == 11);
        uint16_t col = (spLab && (spTxMask & (1 << w))) ? armed : (major ? gold : dim);
        if (spLab && w == spCursor) tft.fillTriangle(x - 3, SP_Y + SP_H + 1, x + 3, SP_Y + SP_H + 1, x, SP_Y + SP_H + 7, caret);
        tft.drawFastVLine(x, SP_Y + SP_H + 8, 3, col);
        tft.setTextColor(col, bg);
        tft.drawString(String(w), x, SP_Y + SP_H + (w & 1 ? 16 : 26), 1);     // odd row higher, even lower
    }
}

static void spDrawFooter() {
    // Passive Spectrum just shows a legend; the Lab generator shows the TX controls.
    // Only glyphs present in the tiny VLW subset (letters, space, ◀ ▶ ▼): ▲▼ move the
    // caret, the middle key (OK) arms the channel, ▶ starts/stops the noise.
    if (!spLab) { uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
                             spTraffic ? i18n::tr("traffic ▶", "трафик ▶") : i18n::tr("occupancy ▶", "занятость ▶")); return; }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
               spTxOn ? (i18n::isRu() ? "▶ стоп"            : "▶ stop")
                      : (i18n::isRu() ? "OK канал  ▶ старт" : "OK chan  ▶ start"));
}

// SELECT arms/disarms the channel under the caret; live if we're already emitting.
static void spToggleArm() {
    spTxMask ^= (uint16_t)(1 << spCursor);
    if (spTxMask == 0) spTxOn = false;              // nothing armed → nothing to emit
    spApplyTx();
    spDrawAxis();
    spDrawFooter();
}

// RIGHT starts/stops the noise. Pressing it with nothing armed arms the caret channel.
static void spToggleTx() {
    if (!spTxOn && spTxMask == 0) spTxMask |= (uint16_t)(1 << spCursor);
    spTxOn = !spTxOn && spTxMask != 0;
    spApplyTx();
    spDrawAxis();
    spDrawFooter();
}

static void drawSpectrumScreen() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f);
    char hr[20];
    if (spLab) {
        snprintf(hr, sizeof(hr), "x%d %s", nrf.modules(),
                 nrf.txListenSelf() ? i18n::tr("chk", "проба") : i18n::tr("max", "макс"));
        uiHeaderRu(i18n::tr("Generator", "Генератор"), hr);
    } else {
        snprintf(hr, sizeof(hr), "NRF24 x%d", nrf.modules());
        uiHeaderRu(i18n::tr("2.4GHz Spectrum", "Спектр 2.4ГГц"), hr);
    }
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    wfLegend(bg, dim, (spTraffic && !spLab) ? i18n::tr("base", "фон") : nullptr,
                      (spTraffic && !spLab) ? i18n::tr("spike", "всплеск") : nullptr);
    tft.fillRect(SP_X, SP_Y, SP_W, SP_H, SP_BG);
    tft.drawRect(SP_X - 1, SP_Y - 1, SP_W + 2, SP_H + 2, tft.color565(0x2a, 0x3a, 0x2a));
    // Vertical divider column for every Wi-Fi channel 1..13 (1/6/11 stand out); pre-drawn
    // full height and overwritten by real energy as the waterfall fills. The tick+number
    // strip and the selection caret below the plot are drawn by spDrawAxis().
    memset(spGrid, 0, sizeof(spGrid));
    for (int w = 1; w <= 13; w++) {
        int sx = spNrfToX(Nrf24Spectrum::wifiCenterNrfCh(w));
        if (sx < 0 || sx >= SP_W) continue;
        spGrid[sx] = (w == 1 || w == 6 || w == 11) ? 2 : 1;
        tft.drawFastVLine(SP_X + sx, SP_Y, SP_H, spGrid[sx] == 2 ? SP_GMAJ : SP_GMIN);
    }
    spDrawAxis();
    spDrawFooter();
    drawNetBadge();
    memset(spEma, 0, sizeof(spEma)); spBasePrime = SP_PRIME_N; spRowAt = millis(); spWy = 0;   // baseline seeds from spEma over the first ~1 s (no cold-start flood)
}

// Spectrum view: occupancy heat vs traffic (above-baseline). Persisted; shared by the
// passive Spectrum and the Lab generator (the passive screen's ▶ flips it live).
static void saveSpView(bool traffic) { Preferences p; p.begin("leshy", false); p.putBool("sp_view", traffic); p.end(); }
static bool loadSpView() { Preferences p; p.begin("leshy", true); bool v = p.getBool("sp_view", false); p.end(); return v; }
// Repaint only the mode chrome (legend + footer) above/below the plot — keeps the
// waterfall and the learned baseline, so occupancy <-> traffic flips instantly.
static void spRepaintChrome() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f);
    tft.fillRect(0, 28, 240, SP_Y - 29, bg);     // legend band above the plot (does not touch the waterfall)
    wfLegend(bg, dim, (spTraffic && !spLab) ? i18n::tr("base", "фон") : nullptr,
                      (spTraffic && !spLab) ? i18n::tr("spike", "всплеск") : nullptr);
    spDrawFooter();
}
static void spToggleView() {
    spTraffic = !spTraffic;
    saveSpView(spTraffic);
    spRepaintChrome();
}

static void spectrumTick() {
    uint8_t sw[Nrf24Spectrum::CHANNELS];
    nrf.sweep(sw);                                       // ~25ms across 126 channels; RPD is 1-bit per channel
    for (int c = 0; c < Nrf24Spectrum::CHANNELS; c++) {
        spEma[c] += ((int)sw[c] * 255 - spEma[c]) / 8;  // fast occupancy (0..255) → occupancy view
        int e1024 = (int)spEma[c] << 10;
        if (spBasePrime) { spCurF[c] = e1024; spBaseF[c] = e1024; }        // seed both to the settling EMA — no cold-start flood
        else {
            spCurF[c]  += (e1024 - spCurF[c])  / SP_CUR_TAU;               // medium: averages out single beacon/BT hits
            spBaseF[c] += (e1024 - spBaseF[c]) / SP_BASE_TAU;              // slow floor: steady sources sink in
        }
    }
    if (spBasePrime) spBasePrime--;
    if (millis() - spRowAt < 37) return;                // one waterfall row every ~37ms (fast scroll)
    spRowAt = millis();
    static uint16_t row[SP_W];
    for (int x = 0; x < SP_W; x++) {
        int c = spXToNrf(x);
        if (c < 0) c = 0; else if (c >= Nrf24Spectrum::CHANNELS) c = Nrf24Spectrum::CHANNELS - 1;
        int v = spEma[c];
        if (spTraffic && !spLab) {                      // traffic (passive only): medium level above the slow floor, noise-gated
            int d = ((spCurF[c] - spBaseF[c]) >> 10) - SP_TRAFFIC_FLOOR;
            v = d > 0 ? d * SP_TRAFFIC_GAIN : 0;
            if (v > 255) v = 255;
        }
        if      (v > 8)            row[x] = spColor(v, 255);             // energy / burst → heat gradient
        else if (spGrid[x] == 2)   row[x] = SP_GMAJ;                      // channel divider shows through quiet air
        else if (spGrid[x] == 1)   row[x] = SP_GMIN;
        else                       row[x] = SP_BG;
    }
    wfPushRow(row);                                     // one row, direct — no pixels moved, no flicker
}

// ---- Sub-GHz spectrum waterfall (CC1101) ----
// Same flicker-free ring waterfall, but the CC1101 gives a real RSSI per frequency,
// so the heat is true signal strength. RIGHT cycles the display window: whole span,
// then aimed technical bands (315/433 remotes & alarms, 868/915 mesh & LoRa).
static const int SUB_NB = 40;                           // frequencies swept per row (fewer = ~3x faster scroll; mapped across the width)
static uint8_t   subE[SUB_NB];
static int       subBin = 0;                            // sweep progress (spread across loop iterations for button responsiveness)

static void subStop() { cc.end(); }

