anton-vinogradov/esp32-leshy/src/main.cpp
static void drawSubScreen() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f), gold = tft.color565(0xff, 0xcf, 0x3f);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uiHeaderRu(i18n::tr("Sub-GHz Spectrum", "Спектр Sub-GHz"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    wfLegend(bg, dim);
    tft.fillRect(SP_X, SP_Y, SP_W, SP_H, SP_BG);
    tft.drawRect(SP_X - 1, SP_Y - 1, SP_W + 2, SP_H + 2, tft.color565(0x2a, 0x3a, 0x2a));
    // axis: localized band name (centre) on the VLW font + the MHz range at the ends
    fontTiny();
    tft.setTextColor(gold, bg); tft.setTextDatum(MC_DATUM);
    tft.drawString(i18n::isRu() ? b.ru : b.en, SP_X + SP_W / 2, SP_Y + SP_H + 13);
    tft.setTextColor(dim, bg);
    tft.setTextDatum(ML_DATUM); tft.drawString(String(b.loKHz / 1000), SP_X, SP_Y + SP_H + 13);
    tft.setTextDatum(MR_DATUM); tft.drawString(String(b.hiKHz / 1000) + (i18n::isRu() ? " МГц" : " MHz"), SP_X + SP_W, SP_Y + SP_H + 13);
    fontOff();
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::tr("band ▶", "диапазон ▶"));
    drawNetBadge();
    spWy = 0; subBin = 0;
}

static void subTick() {
    // Sweep only a few bins per loop iteration so buttons (band switch) stay snappy —
    // a full CC1101 sweep is ~150-250ms, too long to block the input poll.
    for (int k = 0; k < 10 && subBin < SUB_NB; k++, subBin++) subE[subBin] = cc.sampleBin(subBin, SUB_NB);
    if (subBin < SUB_NB) return;                        // sweep still in progress
    subBin = 0;
    static uint16_t row[SP_W];
    for (int x = 0; x < SP_W; x++) {
        int bin = x * SUB_NB / SP_W; if (bin >= SUB_NB) bin = SUB_NB - 1;
        int e = subE[bin];
        row[x] = (e > 12) ? spColor(e, 255) : SP_BG;    // above the noise floor → heat
    }
    wfPushRow(row);
}

// ---- Sub-GHz test transmitter (CC1101) ----
// One CC1101 → pure TX, so it can't watch its own signal — verify on an external RX.
// RIGHT cycles the band, the middle key toggles TX; the sub-GHz antenna LED goes yellow.
static const uint8_t CC_PA[]     = { 0xC0, 0x84, 0x60, 0x34, 0x1D };   // PATABLE presets, max→min
static const int8_t  CC_PA_DBM[] = {   10,    5,    0,   -6,  -15 };   // approx dBm (433 MHz)
static const int     CC_PA_N     = sizeof(CC_PA) / sizeof(CC_PA[0]);
static int  subPwrIdx = 0;                          // 0 = max
static bool subTxOn   = false;

static void saveSubPower(int idx) { Preferences p; p.begin("leshy", false); p.putUChar("cc_pwr_i", (uint8_t)idx); p.end(); }
static int  loadSubPower() { Preferences p; p.begin("leshy", true); int v = p.getUChar("cc_pwr_i", 0); p.end(); return (v >= 0 && v < CC_PA_N) ? v : 0; }

// Sub-GHz settings (set via the SubCfg phone portal, saved to NVS, applied by loadSubCfg).
static uint32_t recWaitMs  = 30000;                 // recorder signal-wait timeout
static uint32_t subFreqKHz = 0;                     // exact TX/capture freq override (0 = band centre)
static int      recRepeats = 3;                     // replay repeat count
static int      subCfgPhase = 0;                    // settings-portal screen phase: 0 waiting · 1 saved · 2 stopped

static bool cc1101FreqOk(uint32_t f) {              // the chip only tunes these sub-bands
    return (f >= 300000 && f <= 348000) || (f >= 387000 && f <= 464000) || (f >= 779000 && f <= 928000);
}

// TX/capture frequency: the exact override if set & tunable, else the band centre, else
// 433.92 (the "full 300-928" centre is 614 MHz, inside a CC1101 gap).
static uint32_t subTxFreqKHz() {
    if (subFreqKHz && cc1101FreqOk(subFreqKHz)) return subFreqKHz;
    uint32_t f = Cc1101Spectrum::bandCenterKHz(cc.bandInfo());
    return cc1101FreqOk(f) ? f : 433920;
}

static void loadSubCfg() {                          // read all Sub-GHz settings from NVS and apply
    Preferences p; p.begin("leshy", true);
    recWaitMs  = p.getUInt("rec_wait", 30000);
    subFreqKHz = p.getUInt("sub_freq", 0);
    recRepeats = p.getUChar("rep_n", 3);
    int  thr   = p.getInt("cap_thr", -72);
    bool fsk   = p.getUChar("sub_mod", 0) != 0;
    bool inv   = p.getBool("sub_inv", false);
    p.end();
    if (recWaitMs < 3000 || recWaitMs > 300000) recWaitMs = 30000;   // guard corrupt/legacy NVS
    if (recRepeats < 1 || recRepeats > 20) recRepeats = 3;
    if (thr < -110 || thr > -30) thr = -72;
    cc.setCaptureThreshold(thr);
    cc.setModulation(fsk);
    cc.setInvert(inv);
}

static void subTxApply() {                          // (re)tune TX to a valid frequency at the set power
    cc.setTxPower(CC_PA[subPwrIdx]);
    cc.beginTx(subTxFreqKHz());
}

static void drawSubTxScreen() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f), red = tft.color565(0xff, 0x5a, 0x32);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uint32_t fk = subTxFreqKHz();                   // actual TX freq (band centre, or 433.92 for the "full" band)
    uiHeaderRu(i18n::tr("Sub-GHz TX", "Тест-передача"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Band:", "Диапазон:"), 10, 50);
    tft.setTextColor(gold, bg);  tft.drawString(i18n::isRu() ? b.ru : b.en, 96, 50);
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Freq:", "Частота:"), 10, 80);
    char fs[24]; snprintf(fs, sizeof(fs), "%lu.%02lu MHz", (unsigned long)(fk / 1000), (unsigned long)((fk % 1000) / 10));
    tft.setTextColor(gold, bg);  tft.drawString(fs, 96, 80);
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Power:", "Мощность:"), 10, 110);
    char ps[16]; snprintf(ps, sizeof(ps), "%d dBm", CC_PA_DBM[subPwrIdx]);
    tft.setTextColor(gold, bg);  tft.drawString(ps, 96, 110);
    fontBig();
    if (subTxOn) { tft.setTextColor(red, bg);  tft.drawString(i18n::tr("TRANSMITTING", "ПЕРЕДАЮ"), 10, 152); }
    else         { tft.setTextColor(gold, bg); tft.drawString(i18n::tr("Ready", "Готов"), 10, 152); }
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("Verify on external RX.", "Проверяй внешним RX."), 10, 194);
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
               subTxOn ? (i18n::isRu() ? "OK стоп  ▶ бэнд" : "OK stop  ▶ band")
                       : (i18n::isRu() ? "OK старт  ▶ бэнд" : "OK start  ▶ band"));
    fontOff();
}

static uint8_t subPowerCycle() {                    // max → … → min → wrap; persists; applied to the chip
    subPwrIdx = (subPwrIdx + 1) % CC_PA_N;
    cc.setTxPower(CC_PA[subPwrIdx]);
    saveSubPower(subPwrIdx);
    return CC_PA[subPwrIdx];
}

static void drawSubPowerInfo() {
    infoTitle = i18n::tr("Sub-GHz TX power", "Мощность Sub-GHz");
    infoBody  = String((int)CC_PA_DBM[subPwrIdx]) + i18n::tr(" dBm", " дБм") + (subPwrIdx == 0 ? i18n::tr(" (max)", " (макс)") : "");
    infoNote  = i18n::tr("Approx power of the Sub-GHz test signal (CC1101, ~10 mW max). Own equipment only.",
                         "Примерная мощность тестового сигнала Sub-GHz (CC1101, макс ~10 мВт). Только своё железо.");
    infoAction = F_SUBPOWER; st = ST_INFO; drawInfo();
}

// ---- Sub-GHz RAW recorder (CC1101) — own-equipment record + replay ----
static uint16_t recBuf[512];                        // captured OOK pulse durations (us)
static int      recN = 0;                            // pulses in the last capture (0 = empty)
static uint32_t recFreqKHz = 0;                      // frequency it was captured on (replay uses it)

static void drawSubRecScreen(const char* status = nullptr) {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f), green = tft.color565(0x3f, 0xe0, 0x7a);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uint32_t fk = subTxFreqKHz();
    uiHeaderRu(i18n::tr("Rec/Replay", "Запись-повтор"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Band:", "Диапазон:"), 10, 50);
    tft.setTextColor(gold, bg);  tft.drawString(i18n::isRu() ? b.ru : b.en, 96, 50);
    tft.setTextColor(white, bg); tft.drawString(i18n::tr("Freq:", "Частота:"), 10, 78);
    char fs[24]; snprintf(fs, sizeof(fs), "%lu.%02lu MHz", (unsigned long)(fk / 1000), (unsigned long)((fk % 1000) / 10));
    tft.setTextColor(gold, bg);  tft.drawString(fs, 96, 78);
    fontBig();
    if (status) { tft.setTextColor(gold, bg); tft.drawString(status, 10, 118); }
    else if (recN > 0) { char cs[28]; snprintf(cs, sizeof(cs), "%s%d", i18n::tr("Saved: ", "Записано: "), recN); tft.setTextColor(green, bg); tft.drawString(cs, 10, 118); }
    else { tft.setTextColor(white, bg); tft.drawString(i18n::tr("Empty", "Пусто"), 10, 118); }
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("Own equipment only.", "Только своё железо."), 10, 152);
    tft.drawString(i18n::tr("OK record", "OK запись"), 10, 174);
    tft.drawString(i18n::tr("up replay", "вверх повтор"), 10, 196);
    tft.drawString(i18n::tr("down band", "вниз бэнд"), 10, 218);
    if (recN > 0) tft.drawString(i18n::tr("right save", "вправо сохранить"), 10, 240);   // only when there's a capture to save
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", recN > 0 ? (i18n::isRu() ? "▶ сохранить" : "▶ save") : nullptr);
    fontOff();
}

