anton-vinogradov/esp32-leshy/src/main.cpp
static void subRecord() {
    loadSubCfg();                                       // apply current settings — playback may have changed cc's modulation
    char msg[24]; snprintf(msg, sizeof(msg), "%s%lus", i18n::tr("Listening ", "Слушаю "), (unsigned long)(recWaitMs / 1000));
    drawSubRecScreen(msg);
    recFreqKHz = subTxFreqKHz();
    cc.beginCapture(recFreqKHz);
    recN = cc.captureRaw(recBuf, 512, recWaitMs);
    drawSubRecScreen();
}

static void subReplay() {
    if (recN <= 0) return;
    drawSubRecScreen(i18n::tr("Replaying...", "Повтор…"));
    cc.setTxPower(CC_PA[subPwrIdx]);
    for (int r = 0; r < recRepeats; r++) {          // remotes send the frame repeated — replay N times
        cc.replayRaw(recBuf, recN, recFreqKHz);
        delay(20);
    }
    drawSubRecScreen();
}

// ---- on-screen keyboard: name a capture before saving it to flash ----
// The VLW fonts carry the full printable ASCII, so a plain alphanumeric grid renders fine.
static const char* KB_ROWS[] = { "ABCDEFGHIJ", "KLMNOPQRST", "UVWXYZ0123", "456789-_.," };
static const char* KB_SPEC[] = { "SPC", "DEL", "OK", "ESC" };
static const int KB_NROW = 4, KB_NCOL = 10, KB_NSPEC = 4;
static const int KB_X0 = 6, KB_CW = 23, KB_CH = 30, KB_Y0 = 80, KB_RSTEP = 34;
static const int KB_SY = KB_Y0 + KB_NROW * KB_RSTEP, KB_SX = 6, KB_SW = 56, KB_SSTEP = 58;

static char  kbBuf[RecStore::NAME_LEN + 1] = {0};
static int   kbLen = 0, kbRow = 0, kbCol = 0;

static int kbRowCols(int row) { return row < KB_NROW ? KB_NCOL : KB_NSPEC; }

static void kbCellRect(int row, int col, int& x, int& y, int& w, int& h) {
    if (row < KB_NROW) { x = KB_X0 + col * KB_CW;   y = KB_Y0 + row * KB_RSTEP; w = KB_CW - 2; h = KB_CH; }
    else               { x = KB_SX + col * KB_SSTEP; y = KB_SY;                 w = KB_SW;     h = KB_CH; }
}

// Assumes a smooth font is already loaded (caller manages fontSmall/fontOff).
static void drawKbCell(int row, int col, bool sel) {
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f);
    int x, y, w, h; kbCellRect(row, col, x, y, w, h);
    uint16_t box = sel ? tft.color565(0x2c, 0x5a, 0x2c) : tft.color565(0x1b, 0x27, 0x1b);
    tft.fillRoundRect(x, y, w, h, 5, box);
    char lbl[4];
    if (row < KB_NROW) { lbl[0] = KB_ROWS[row][col]; lbl[1] = 0; }
    else               { strncpy(lbl, KB_SPEC[col], sizeof(lbl) - 1); lbl[sizeof(lbl) - 1] = 0; }
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(sel ? gold : white, box);
    tft.drawString(lbl, x + w / 2, y + h / 2);
}

static void drawKbName() {
    const uint16_t bg = uiBg(), gold = tft.color565(0xe7, 0xcf, 0x8f);
    tft.fillRect(0, 44, 240, 30, bg);
    fontBig();
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(gold, bg);
    char shown[RecStore::NAME_LEN + 2];
    snprintf(shown, sizeof(shown), "%s_", kbBuf);       // trailing caret
    tft.drawString(shown, 10, 48);
    fontOff();
}

static void drawKeyboard(bool full) {
    if (full) { uiHeaderRu(i18n::tr("Name", "Имя записи")); tft.fillRect(0, 28, 240, 320 - 28, uiBg()); }
    drawKbName();
    fontSmall();
    for (int r = 0; r <= KB_NROW; r++)
        for (int c = 0; c < kbRowCols(r); c++) drawKbCell(r, c, r == kbRow && c == kbCol);
    fontOff();
    uiFooterRu(i18n::isRu() ? "◀▶▼▲ выбор" : "◀▶▼▲ move", i18n::isRu() ? "OK ввод" : "OK pick");
}

static void kbRepaintCursor(int pr, int pc) {
    if (pr == kbRow && pc == kbCol) return;
    fontSmall(); drawKbCell(pr, pc, false); drawKbCell(kbRow, kbCol, true); fontOff();
}

static void kbCommit() {
    if (kbLen == 0) return;                             // a name is required
    if (!RecStore::exists(kbBuf) && RecStore::count() >= RecStore::MAX_RECS) {
        st = ST_SUBREC; drawSubRecScreen(i18n::tr("Full (64 max)", "Заполнено (64)")); return;
    }
    bool ok = RecStore::save(kbBuf, recBuf, recN, recFreqKHz, cc.modulation(), cc.inverted(), cc.startLevel());
    st = ST_SUBREC;
    if (ok) { char m[RecStore::NAME_LEN + 24]; snprintf(m, sizeof(m), "%s%s", i18n::tr("Saved: ", "Сохранено: "), kbBuf); drawSubRecScreen(m); }
    else    drawSubRecScreen(i18n::tr("Save error", "Ошибка ФС"));
}

static void kbSelect() {
    if (kbRow < KB_NROW) {                              // a character key
        if (kbLen < RecStore::NAME_LEN) { kbBuf[kbLen++] = KB_ROWS[kbRow][kbCol]; kbBuf[kbLen] = 0; drawKbName(); }
        return;
    }
    switch (kbCol) {                                    // special row
        case 0: if (kbLen < RecStore::NAME_LEN) { kbBuf[kbLen++] = ' '; kbBuf[kbLen] = 0; drawKbName(); } break;  // SPC
        case 1: if (kbLen > 0) { kbBuf[--kbLen] = 0; drawKbName(); } break;                                       // DEL
        case 2: kbCommit(); break;                                                                                // OK
        case 3: st = ST_SUBREC; drawSubRecScreen(); break;                                                        // ESC (discard)
    }
}

// ---- playback: browse + replay + delete the saved library ----
static const int RP_TOP = 42, RP_ROW_H = 30, RP_VISIBLE = 8;
static String recNames[RecStore::MAX_RECS];
static int    recCount = 0, recSel = 0, recOff = 0;
static bool   recDelArm = false;                        // delete confirmation armed

static void clampRecList() {
    if (recSel < recOff) recOff = recSel;
    if (recSel >= recOff + RP_VISIBLE) recOff = recSel - RP_VISIBLE + 1;
    if (recOff > recCount - RP_VISIBLE) recOff = recCount - RP_VISIBLE;   // pull the window up when the list shrank
    if (recOff < 0) recOff = 0;
}

static void drawRecPlayRow(int slot) {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f);
    int idx = recOff + slot, y = RP_TOP + slot * RP_ROW_H;
    tft.fillRect(0, y, 240, RP_ROW_H, bg);
    if (idx >= recCount) return;
    bool sel = (idx == recSel);
    uint16_t rowbg = sel ? tft.color565(0x22, 0x33, 0x22) : bg;
    if (sel) tft.fillRoundRect(6, y, 228, RP_ROW_H - 4, 6, rowbg);
    fontSmall();
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(sel ? gold : white, rowbg);
    tft.drawString(recNames[idx], 14, y + 8);
    fontOff();
}

static void drawRecList() { for (int s = 0; s < RP_VISIBLE; s++) drawRecPlayRow(s); }

static void drawRecPlayScreen(const char* status = nullptr) {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f);
    uiHeaderRu(i18n::tr("Playback", "Воспроизведение"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    if (recCount == 0) {
        fontBig(); tft.setTextDatum(TL_DATUM); tft.setTextColor(white, bg);
        tft.drawString(i18n::tr("Empty", "Пусто"), 10, 60);
        fontSmall(); tft.drawString(i18n::tr("Record a signal first", "Сначала запиши сигнал"), 10, 100);
        fontOff();
    } else {
        drawRecList();
    }
    if (status) { fontSmall(); tft.setTextDatum(TL_DATUM); tft.setTextColor(gold, bg); tft.drawString(status, 10, 286); fontOff(); }
    if (recDelArm) uiFooterRu(i18n::isRu() ? "◀ отмена"  : "◀ cancel", i18n::isRu() ? "OK удалить" : "OK delete");
    else           uiFooterRu(i18n::isRu() ? "◀ назад"   : "◀ back",   i18n::isRu() ? "OK повтор ▶ уд" : "OK play ▶ del");
}

static void recPlaySelected() {
    if (recSel < 0 || recSel >= recCount) return;
    int n, sl; uint32_t fk; bool fsk, inv;
    if (!RecStore::load(recNames[recSel].c_str(), recBuf, 512, n, fk, fsk, inv, sl)) { drawRecPlayScreen(i18n::tr("Load error", "Ошибка чтения")); return; }
    recN = n; recFreqKHz = fk;
    cc.setModulation(fsk); cc.setInvert(inv); cc.setStartLevel(sl);   // reproduce this slot's exact settings
    cc.setTxPower(CC_PA[subPwrIdx]);
    drawRecPlayScreen(i18n::tr("Replaying...", "Повтор…"));
    for (int r = 0; r < recRepeats; r++) { cc.replayRaw(recBuf, recN, recFreqKHz); delay(20); }
    loadSubCfg();                                       // restore the user's live settings for the next capture
    drawRecPlayScreen(i18n::tr("Done", "Готово"));
}

static void recDeleteSelected() {
    recDelArm = false;
    if (recSel >= 0 && recSel < recCount) RecStore::remove(recNames[recSel].c_str());
    recCount = RecStore::list(recNames, RecStore::MAX_RECS);
    if (recSel >= recCount) recSel = recCount > 0 ? recCount - 1 : 0;
    clampRecList();
    drawRecPlayScreen(i18n::tr("Deleted", "Удалено"));
}

// ---- Sub-GHz frequency hunter: find the frequency of your own tag/remote (pure RX) ----
struct HuntWin { uint32_t lo, hi; };
static const HuntWin HUNT_WINS[] = { {300000, 348000}, {387000, 464000}, {779000, 928000} };   // CC1101 tunable windows
static const int      HUNT_NWIN = sizeof(HUNT_WINS) / sizeof(HUNT_WINS[0]);
static const uint32_t HUNT_STEP = 250;              // kHz coarse grid (RX bandwidth ~200 kHz)
static const int      HUNT_RISE = 12;               // dB a bin must rise above its calibrated baseline to count
static const int      HUNT_MAXBINS = 1200;          // baseline array cap (actual ~1099)
static const int      HUNT_CALIB_PASSES = 2;        // baseline = per-bin MIN over N passes → a stray press can't poison it

// Phases: CALIB measures a per-bin baseline (ambient + the chip's own crystal-harmonic birdies, e.g.
// 26 MHz*12 = 312 MHz), HUNT looks for a bin that RISES above its baseline when you press the tag,
// REFINE narrows that bin to ~50 kHz. Rise detection is what lets a real button-press beat the
// always-present internal spurs — plain argmax(RSSI) just locks onto the 312 MHz birdie.
enum HuntPhase { HP_CALIB, HP_HUNT, HP_REFINE };
static HuntPhase huntPhase = HP_CALIB;
static int8_t   huntBase[HUNT_MAXBINS];             // per-bin baseline RSSI (dBm)
static int      huntN = 0;                          // active bin count
static int      huntBin = 0;                        // sweep cursor (flat bin index)
static int      huntCalibPass = 0;                  // which baseline pass we're on
static bool     huntCalibrated = false;
static bool     huntLocked = false;
static int      huntBestRise = -999; static uint32_t huntBestKHz = 0; static int huntBestDbm = -128;   // current pass
static uint32_t huntShowKHz = 0; static int huntShowRise = 0, huntShowDbm = -128;                      // shown result
static int      huntMiss = 0;
static uint32_t huntRefF = 0, huntRefHi = 0, huntRefBestK = 0; static int huntRefBestRise = -999, huntRefBestDbm = -128;
static uint32_t huntLastDraw = 0;

