anton-vinogradov/esp32-leshy/src/main.cpp
static int huntBinCount() {
    int n = 0;
    for (int w = 0; w < HUNT_NWIN; w++) n += (int)((HUNT_WINS[w].hi - HUNT_WINS[w].lo) / HUNT_STEP) + 1;
    return n;
}
static uint32_t huntBinFreq(int idx) {
    for (int w = 0; w < HUNT_NWIN; w++) {
        int n = (int)((HUNT_WINS[w].hi - HUNT_WINS[w].lo) / HUNT_STEP) + 1;
        if (idx < n) return HUNT_WINS[w].lo + (uint32_t)idx * HUNT_STEP;
        idx -= n;
    }
    return HUNT_WINS[HUNT_NWIN - 1].hi;
}
static int huntBaseAt(uint32_t f) {                 // nearest coarse bin's baseline (for the fine refine sweep)
    int base = 0;
    for (int w = 0; w < HUNT_NWIN; w++) {
        int n = (int)((HUNT_WINS[w].hi - HUNT_WINS[w].lo) / HUNT_STEP) + 1;
        if (f >= HUNT_WINS[w].lo && f <= HUNT_WINS[w].hi) {
            int off = (int)((f - HUNT_WINS[w].lo + HUNT_STEP / 2) / HUNT_STEP);
            int idx = base + off;
            if (idx >= huntN) idx = huntN - 1;
            return huntBase[idx];
        }
        base += n;
    }
    return -100;
}

static const char* huntGuess(uint32_t k) {          // nearest common alarm/remote ISM point
    struct Pt { uint32_t f; const char* n; };
    static const Pt T[] = { {315000, "315"}, {390000, "390"}, {418000, "418"}, {433920, "433.92 ISM"},
                            {434420, "434.42"}, {868350, "868.35 ISM"}, {915000, "915 ISM"} };
    for (const Pt& t : T) { uint32_t d = k > t.f ? k - t.f : t.f - k; if (d <= 350) return t.n; }
    return "";
}

static void huntReset() {                           // (re)start with a fresh baseline calibration
    huntN = huntBinCount(); if (huntN > HUNT_MAXBINS) huntN = HUNT_MAXBINS;
    huntPhase = HP_CALIB; huntBin = 0; huntCalibPass = 0;
    huntCalibrated = false; huntLocked = false;
    huntShowKHz = 0; huntShowRise = 0; huntShowDbm = -128; huntMiss = 0;
    huntBestRise = -999; huntBestKHz = 0; huntBestDbm = -128;
}

static void drawHuntChrome() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0);
    uiHeaderRu(i18n::tr("Freq finder", "Частотомер"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontSmall(); tft.setTextDatum(TL_DATUM); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("Hold the tag by the antenna.", "Держи метку у антенны."), 10, 210);
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::isRu() ? "▶ калибровать" : "▶ recal");
    fontOff();
}

static void drawHuntValues() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f),
                   green = tft.color565(0x3f, 0xe0, 0x7a), grayc = tft.color565(0x80, 0x88, 0x80);
    tft.fillRect(0, 56, 240, 150, bg);
    tft.setTextDatum(TL_DATUM);
    fontBig();
    if (huntLocked && huntShowKHz) {
        char fs[16]; snprintf(fs, sizeof(fs), "%lu.%02lu", (unsigned long)(huntShowKHz / 1000), (unsigned long)((huntShowKHz % 1000) / 10));
        tft.setTextColor(green, bg); tft.drawString(fs, 10, 66);
        fontSmall(); tft.setTextColor(white, bg); tft.drawString(i18n::tr("MHz", "МГц"), 150, 84);
        const char* g = huntGuess(huntShowKHz);
        if (*g) { tft.setTextColor(gold, bg); tft.drawString(g, 10, 118); }
    } else {
        tft.setTextColor(grayc, bg);
        tft.drawString(huntCalibrated ? i18n::tr("searching...", "поиск…") : i18n::tr("calibrating...", "калибровка…"), 10, 66);
    }
    fontSmall(); tft.setTextColor(white, bg);
    char l1[64];
    if (!huntCalibrated)     snprintf(l1, sizeof(l1), "%s", i18n::tr("measuring floor - don't press", "меряю фон — не жми метку"));
    else if (huntLocked)     snprintf(l1, sizeof(l1), "%s+%d dB  %d dBm", i18n::tr("rise ", "подъём "), huntShowRise, huntShowDbm);
    else if (huntMiss >= 6)  snprintf(l1, sizeof(l1), "%s", i18n::tr("no rise - press tag or > recal", "нет подъёма, жми метку или ▶"));
    else                     snprintf(l1, sizeof(l1), "%s", i18n::tr("press the tag button", "жми кнопку метки"));
    tft.drawString(l1, 10, 156);
    fontOff();
}

static void huntTick() {
    const int BATCH = 16;                               // bounded work per loop() so buttons stay responsive
    if (huntPhase == HP_CALIB) {
        for (int i = 0; i < BATCH && huntBin < huntN; i++) {
            int dbm = cc.rssiAt(huntBinFreq(huntBin));
            int8_t v = (int8_t)(dbm < -128 ? -128 : (dbm > 0 ? 0 : dbm));
            huntBase[huntBin] = (huntCalibPass == 0 || v < huntBase[huntBin]) ? v : huntBase[huntBin];   // per-bin MIN across passes
            huntBin++;
        }
        if (huntBin >= huntN) {
            if (++huntCalibPass < HUNT_CALIB_PASSES) { huntBin = 0; }   // one more baseline pass (min rejects a stray press)
            else {                                                     // baseline done → start hunting for a rise
                huntCalibrated = true; huntPhase = HP_HUNT; huntBin = 0;
                huntBestRise = -999; huntBestKHz = 0; huntBestDbm = -128;
            }
        }
    } else if (huntPhase == HP_HUNT) {
        for (int i = 0; i < BATCH && huntBin < huntN; i++) {
            uint32_t f = huntBinFreq(huntBin);
            int dbm = cc.rssiAt(f);
            int rise = dbm - huntBase[huntBin];         // how far this bin rose above its own baseline
            if (rise > huntBestRise) { huntBestRise = rise; huntBestKHz = f; huntBestDbm = dbm; }
            huntBin++;
        }
        if (huntBin >= huntN) {                         // pass complete
            if (huntBestRise >= HUNT_RISE) {            // a bin rose → real signal (not a constant spur)
                huntRefF = huntBestKHz > 1200 ? huntBestKHz - 1200 : 1;
                huntRefHi = huntBestKHz + 1200;
                huntRefBestRise = huntBestRise; huntRefBestK = huntBestKHz; huntRefBestDbm = huntBestDbm;
                huntPhase = HP_REFINE;
            } else if (++huntMiss >= 2) {               // two empty passes → drop a stale lock (fast re-aim)
                huntLocked = false; huntShowKHz = 0;
            }
            huntBin = 0; huntBestRise = -999; huntBestKHz = 0; huntBestDbm = -128;
        }
    } else {                                            // HP_REFINE — fine ±1.2 MHz sweep by rise, spread across ticks
        for (int i = 0; i < BATCH && huntRefF <= huntRefHi; i++) {
            if (cc1101FreqOk(huntRefF)) {
                int d = cc.rssiAt(huntRefF);
                int rise = d - huntBaseAt(huntRefF);
                if (rise > huntRefBestRise) { huntRefBestRise = rise; huntRefBestK = huntRefF; huntRefBestDbm = d; }
            }
            huntRefF += 50;
        }
        if (huntRefF > huntRefHi) {                     // refine complete → publish
            huntShowKHz = huntRefBestK; huntShowDbm = huntRefBestDbm; huntShowRise = huntRefBestRise;
            huntLocked = true; huntMiss = 0;
            huntPhase = HP_HUNT; huntBin = 0; huntBestRise = -999; huntBestKHz = 0; huntBestDbm = -128;
        }
    }
    if (millis() - huntLastDraw > 250) { huntLastDraw = millis(); drawHuntValues(); }
}

static void drawSubCfgScreen() {
    const uint16_t bg = uiBg(), white = tft.color565(0xe8, 0xe8, 0xe0), gold = tft.color565(0xe7, 0xcf, 0x8f);
    uiHeaderRu(i18n::tr("Sub-GHz setup", "Настройки Sub-GHz"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("1. Join this Wi-Fi:", "1. Подключись к сети:"), 10, 50);
    tft.setTextColor(gold, bg);  tft.drawString(SubCfg::apName(), 10, 74);
    tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("2. Set the fields, save.", "2. Задай поля, сохрани."), 10, 108);
    fontBig();
    if (!subcfg.isRunning()) { tft.setTextColor(tft.color565(0x3f, 0xe0, 0x7a), bg); tft.drawString(i18n::tr("Saved.", "Сохранено."), 10, 150); }
    else if (subcfg.saved()) { tft.setTextColor(tft.color565(0x3f, 0xe0, 0x7a), bg); tft.drawString(i18n::tr("Got it!", "Принял!"), 10, 150); }
    else { tft.setTextColor(gold, bg); tft.drawString(i18n::tr("Waiting...", "Жду…"), 10, 150); }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
}

// ---- Wi-Fi scan selection + per-network options ----
static void ensureWifiVisible() {
    int n = engine.wifiCount();
    if (wifiSel > n - 1) wifiSel = n - 1;
    if (wifiSel < 0) wifiSel = 0;
    if (wifiSel < off) off = wifiSel;
    if (wifiSel >= off + UI_VISIBLE) off = wifiSel - UI_VISIBLE + 1;
    if (off < 0) off = 0;
}

static void gotoWifi() {
    if (scanPausedAt && millis() - scanPausedAt > 5000) engine.clearSparks();  // long gap → the graph would splice two sessions into one line
    scanPausedAt = 0;
    engine.setMode(ScanEngine::SCAN_WIFI); engine.resume();
    st = ST_WIFI; seenWifiGen = engine.wifiGen();
    ensureWifiVisible();
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());   // clear the canvas once on entry; ticks repaint rows only
    drawList(true);
}

