anton-vinogradov/esp32-leshy/src/main.cpp
// One place that handles a navigation event, whether it came from the keypad or the serial remote.
static void onKey(int ev) {
    switch (ev) {
        case Buttons::UP:
            if (st == ST_MENU) { if (curSel() > 0) { int p = curSel(); curSel()--; menuScreen.repaint(p, curSel()); } }
            else if (st == ST_WIFI)    { if (wifiSel > 0) { wifiSel--; ensureWifiVisible(); drawList(false); } }
            else if (st == ST_BLE)     { if (off > 0) { off--; drawList(false); } }
            else if (st == ST_CONN)    { if (connSel > 0) { int p = connSel; connSel--; drawActionBtn(connActY[p], connLabel(connActs[p]), false); drawActionBtn(connActY[connSel], connLabel(connActs[connSel]), true); } }
            else if (st == ST_OPTIONS) { if (optSel > 0)  { int p = optSel;  optSel--;  drawActionBtn(optY[p], optLabels[p], false); drawActionBtn(optY[optSel], optLabels[optSel], true); } }
            else if (st == ST_HIDDEN)  { if (hidSel > 0)  { int p = hidSel; hidSel--; int oo = hidOff; clampHidden(); if (hidOff != oo) drawHiddenRowsOnly(); else { drawHiddenRow(p - hidOff); drawHiddenRow(hidSel - hidOff); } } }
            else if (st == ST_LEGAL)   { if (legOff > 0) { legOff -= 4; if (legOff < 0) legOff = 0; drawLegalScreen(); } }
            else if (st == ST_LANGPICK){ if (langPickSel > 0) { langPickSel--; drawLangPick(); } }
            else if (st == ST_SPECTRUM && spLab){ if (spCursor > 1)  { spCursor--; spDrawAxis(); } }   // move the TX channel caret
            else if (st == ST_SUBREC) subReplay();   // up = replay the captured signal
            else if (st == ST_KEYBOARD) { int pr = kbRow, pc = kbCol; if (kbRow > 0) kbRow--; if (kbCol >= kbRowCols(kbRow)) kbCol = kbRowCols(kbRow) - 1; kbRepaintCursor(pr, pc); }
            else if (st == ST_REC_PLAY) { if (recDelArm) { recDelArm = false; drawRecPlayScreen(); } else if (recSel > 0) { int p = recSel; recSel--; tft.fillRect(0, 283, 240, 18, uiBg()); int oo = recOff; clampRecList(); if (recOff != oo) drawRecList(); else { drawRecPlayRow(p - recOff); drawRecPlayRow(recSel - recOff); } } }
            break;
        case Buttons::DOWN:
            if (st == ST_MENU) { if (curSel() < MENUS[curMenu()].n - 1) { int p = curSel(); curSel()++; menuScreen.repaint(p, curSel()); } }
            else if (st == ST_WIFI)    { if (wifiSel < engine.wifiCount() - 1) { wifiSel++; ensureWifiVisible(); drawList(false); } }
            else if (st == ST_BLE)     { int m = engine.bleCount() - UI_VISIBLE; if (m < 0) m = 0; if (off < m) { off++; drawList(false); } }
            else if (st == ST_CONN)    { if (connSel < connActN - 1) { int p = connSel; connSel++; drawActionBtn(connActY[p], connLabel(connActs[p]), false); drawActionBtn(connActY[connSel], connLabel(connActs[connSel]), true); } }
            else if (st == ST_OPTIONS) { if (optSel < optN - 1)      { int p = optSel;  optSel++;  drawActionBtn(optY[p], optLabels[p], false); drawActionBtn(optY[optSel], optLabels[optSel], true); } }
            else if (st == ST_HIDDEN)  { if (hidSel < revealer.count() - 1) { int p = hidSel; hidSel++; int oo = hidOff; clampHidden(); if (hidOff != oo) drawHiddenRowsOnly(); else { drawHiddenRow(p - hidOff); drawHiddenRow(hidSel - hidOff); } } }
            else if (st == ST_LEGAL)   { int m = legN - LEG_LINES; if (m < 0) m = 0; if (legOff < m) { legOff += 4; if (legOff > m) legOff = m; drawLegalScreen(); } }
            else if (st == ST_LANGPICK){ if (langPickSel < 1) { langPickSel++; drawLangPick(); } }
            else if (st == ST_SPECTRUM && spLab){ if (spCursor < 13) { spCursor++; spDrawAxis(); } }   // move the TX channel caret
            else if (st == ST_SUBREC) { cc.setBand(cc.band() + 1); recN = 0; drawSubRecScreen(); }   // down = cycle band (drops the capture)
            else if (st == ST_KEYBOARD) { int pr = kbRow, pc = kbCol; if (kbRow < KB_NROW) kbRow++; if (kbCol >= kbRowCols(kbRow)) kbCol = kbRowCols(kbRow) - 1; kbRepaintCursor(pr, pc); }
            else if (st == ST_REC_PLAY) { if (recDelArm) { recDelArm = false; drawRecPlayScreen(); } else if (recSel < recCount - 1) { int p = recSel; recSel++; tft.fillRect(0, 283, 240, 18, uiBg()); int oo = recOff; clampRecList(); if (recOff != oo) drawRecList(); else { drawRecPlayRow(p - recOff); drawRecPlayRow(recSel - recOff); } } }
            break;
        case Buttons::SELECT:                    // middle = enter / confirm
            if (st == ST_LANGPICK) { Lang l = langPickSel ? Lang::RU : Lang::EN; i18n::set(l); saveLang(l); gotoLegal(true); }
            else if (st == ST_LEGAL) {
                if (!legFirstRun) { showMenu(); }
                else if (legAccepted) { legalMarkSeen(); legFirstRun = false; depth = 0; showMenu(); }
            }
            else if (st == ST_MENU) activate();
            else if (st == ST_CONN) connActivate();
            else if (st == ST_OPTIONS) optActivate();
            else if (st == ST_CONFIRM) doConfirm();
            else if (st == ST_OTA) otaActivate();
            else if (st == ST_WIFI) openNetOptions();
            else if (st == ST_SPECTRUM && spLab) spToggleArm();   // arm/disarm the caret channel for TX noise
            else if (st == ST_SUBTX) { subTxOn = !subTxOn; if (subTxOn) subTxApply(); else cc.endTx(); drawSubTxScreen(); }
            else if (st == ST_SUBREC) subRecord();       // OK = capture the next signal
            else if (st == ST_KEYBOARD) kbSelect();
            else if (st == ST_REC_PLAY) { if (recDelArm) recDeleteSelected(); else recPlaySelected(); }
            else if (st == ST_SUBHUNT) { huntReset(); drawHuntValues(); }   // OK = restart the hunt
            else if (st == ST_INFO && infoAction == F_LEDS)      { leds.cycleBrightness(); drawLedsInfo(); }
            else if (st == ST_INFO && infoAction == F_BACKLIGHT) { uiBacklightCycle();     drawBacklightInfo(); }
            else if (st == ST_INFO && infoAction == F_TXPOWER)   { txPowerCycle();         drawTxPowerInfo(); }
            else if (st == ST_INFO && infoAction == F_TXMODE)    { txModeCycle();          drawTxModeInfo(); }
            else if (st == ST_INFO && infoAction == F_SUBPOWER)  { subPowerCycle();        drawSubPowerInfo(); }
            break;
        case Buttons::RIGHT:                      // right = options / action
            if (st == ST_LANGPICK) { Lang l = langPickSel ? Lang::RU : Lang::EN; i18n::set(l); saveLang(l); gotoLegal(true); }
            else if (st == ST_LEGAL) {
                if (!legFirstRun) { showMenu(); }
                else if (legAccepted) { legalMarkSeen(); legFirstRun = false; depth = 0; showMenu(); }
            }
            else if (st == ST_MENU) activate();
            else if (st == ST_CONN) connActivate();
            else if (st == ST_OPTIONS) optActivate();
            else if (st == ST_CONFIRM) doConfirm();
            else if (st == ST_OTA) otaActivate();
            else if (st == ST_HIDDEN) openHiddenOptions();
            else if (st == ST_WIFI) openNetOptions();
            else if (st == ST_SUBSPECTRUM) { cc.setBand(cc.band() + 1); drawSubScreen(); }   // cycle the displayed band
            else if (st == ST_SUBTX) { cc.setBand(cc.band() + 1); if (subTxOn) subTxApply(); drawSubTxScreen(); }   // cycle the TX band
            else if (st == ST_SUBREC) { if (recN > 0) { kbBuf[0] = 0; kbLen = 0; kbRow = 0; kbCol = 0; st = ST_KEYBOARD; drawKeyboard(true); } }   // right = name + save the capture
            else if (st == ST_KEYBOARD) { int pc = kbCol; if (kbCol < kbRowCols(kbRow) - 1) kbCol++; kbRepaintCursor(kbRow, pc); }
            else if (st == ST_REC_PLAY) { if (recCount > 0 && !recDelArm) { recDelArm = true; drawRecPlayScreen(); } }   // right = arm delete
            else if (st == ST_SUBHUNT) { huntReset(); drawHuntValues(); }   // right = reset the peak hold
            else if (st == ST_SPECTRUM && spLab) spToggleTx();    // Lab: start/stop transmitting noise into the armed channels
            else if (st == ST_SPECTRUM)          spToggleView();  // passive: flip occupancy <-> traffic view
            else if (st == ST_INFO && infoAction == F_LEDS)      { leds.cycleBrightness(); drawLedsInfo(); }
            else if (st == ST_INFO && infoAction == F_BACKLIGHT) { uiBacklightCycle();     drawBacklightInfo(); }
            else if (st == ST_INFO && infoAction == F_TXPOWER)   { txPowerCycle();         drawTxPowerInfo(); }
            else if (st == ST_INFO && infoAction == F_TXMODE)    { txModeCycle();          drawTxModeInfo(); }
            else if (st == ST_INFO && infoAction == F_SUBPOWER)  { subPowerCycle();        drawSubPowerInfo(); }
            break;
        case Buttons::LEFT:
            if (st == ST_KEYBOARD) { int pc = kbCol; if (kbCol > 0) kbCol--; kbRepaintCursor(kbRow, pc); }   // cursor left — never falls through to back()
            else if (st == ST_REC_PLAY && recDelArm) { recDelArm = false; drawRecPlayScreen(); }              // cancel the delete confirm
            else back();
            break;
        default:
            break;
    }
}

// Serial remote (headless testing over USB): u/d/l/r/o = keys; scan/ble/hidden/conn/menu = jump.
static void serialControl() {
    static char buf[24];
    static uint8_t len = 0;
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\n' || c == '\r') {
            if (!len) continue;
            buf[len] = 0; len = 0;
            // the first-run notice must not be bypassed — only nav keys work there
            if (st == ST_LANGPICK || (st == ST_LEGAL && legFirstRun)) {
                if      (!strcmp(buf, "u")) onKey(Buttons::UP);
                else if (!strcmp(buf, "d")) onKey(Buttons::DOWN);
                else if (!strcmp(buf, "o") || !strcmp(buf, "s") || !strcmp(buf, "r")) onKey(Buttons::SELECT);
                Serial.printf("[cmd] %s -> st=%d\n", buf, (int)st);
                continue;
            }
            if      (!strcmp(buf, "u")) onKey(Buttons::UP);
            else if (!strcmp(buf, "d")) onKey(Buttons::DOWN);
            else if (!strcmp(buf, "l")) onKey(Buttons::LEFT);
            else if (!strcmp(buf, "r")) onKey(Buttons::RIGHT);
            else if (!strcmp(buf, "o") || !strcmp(buf, "s")) onKey(Buttons::SELECT);
            else if (!strcmp(buf, "scan"))   launch(F_WIFI_SCAN);
            else if (!strcmp(buf, "ble"))    launch(F_BLE_SCAN);
            else if (!strcmp(buf, "hidden")) launch(F_HIDDEN);
            else if (!strcmp(buf, "conn"))   launch(F_CONN);
            else if (!strcmp(buf, "ota"))    launch(F_OTA);
            else if (!strcmp(buf, "deauth")) launch(F_DEAUTH);
            else if (!strcmp(buf, "chan"))   launch(F_CHANNELS);
            else if (!strcmp(buf, "legal"))  launch(F_LEGAL);
            else if (!strcmp(buf, "legalreset")) { Preferences p; p.begin("leshy", false); p.remove("legal_ok"); p.end(); Serial.println("[cmd] legal flag cleared — reboot to see the gate"); }
            else if (!strcmp(buf, "leds"))  { leds.selfTest(); continue; }                       // QA: all four pixels + their order
            else if (!strcmp(buf, "ledbr")) { Serial.printf("[leds] brightness -> %u/255\n", leds.cycleBrightness()); continue; }
            else if (!strcmp(buf, "bl"))    { Serial.printf("[bl] backlight -> %u/255\n", uiBacklightCycle()); continue; }
            else if (!strcmp(buf, "txpwr")) { Serial.printf("[txpwr] -> %d dBm\n", Nrf24Spectrum::txPowerDbm(txPowerCycle())); continue; }
            else if (!strcmp(buf, "txmode")){ Serial.printf("[txmode] -> %s\n", txModeCycle() ? "verify (listen)" : "maximum (all TX)"); continue; }
            else if (!strcmp(buf, "view"))  { spTraffic = !spTraffic; saveSpView(spTraffic); if (st == ST_SPECTRUM) spRepaintChrome(); Serial.printf("[view] -> %s\n", spTraffic ? "traffic" : "occupancy"); continue; }
            else if (!strcmp(buf, "air"))   { uint16_t pm[14]; airtime.read(pm); Serial.printf("[air] run=%d ch=%d busy‰:", (int)airtime.isRunning(), (int)airtime.channel());
                                              for (int ch = 1; ch <= 13; ch++) Serial.printf(" %d:%u", ch, pm[ch]); Serial.println(); continue; }
            else if (!strcmp(buf, "nrfdiag")) { engine.pauseAndWait(); nrf.diag(); continue; }
            else if (!strcmp(buf, "cc")) {   // QA: probe CC1101 + a quick RSSI sweep of the current band
                engine.pauseAndWait();
                bool ok = cc.begin();
                Serial.printf("[cc] present=%d version=0x%02X\n", (int)ok, cc.version());
                if (ok) {
                    static uint8_t e[64];
                    cc.sweep(e, 64);
                    Serial.printf("[cc] %s RSSI64:", cc.bandInfo().en);
                    for (int i = 0; i < 64; i++) Serial.printf(" %d", e[i]);
                    Serial.println();
                }
                cc.end();
                continue;
            }
            else if (!strcmp(buf, "ccrssi")) {   // QA: live RSSI on the sub-GHz capture freq → pick the threshold
                engine.pauseAndWait();
                if (cc.begin()) cc.diagRssi(subTxFreqKHz());
                else Serial.println("[ccrssi] chip not present");
                cc.end();
                continue;
            }
            else if (!strcmp(buf, "nrf"))   {   // QA: probe the NRF24 spectrum sniffer on real hardware
                engine.pauseAndWait();
                bool ok = nrf.begin();
                Serial.printf("[nrf] present=%d modules=%d\n", (int)ok, nrf.modules());
                if (ok) {
                    static uint16_t acc[Nrf24Spectrum::CHANNELS];
                    memset(acc, 0, sizeof(acc));
                    uint8_t sw[Nrf24Spectrum::CHANNELS];
                    for (int p = 0; p < 300; p++) { nrf.sweep(sw); for (int c = 0; c < Nrf24Spectrum::CHANNELS; c++) acc[c] += sw[c]; }
                    Serial.print("[nrf] hits/300:");
                    for (int c = 0; c < Nrf24Spectrum::CHANNELS; c++) if (acc[c]) Serial.printf(" %d:%d", c, acc[c]);
                    Serial.println();
                    for (int w = 1; w <= 13; w++) { int nc = Nrf24Spectrum::wifiCenterNrfCh(w); Serial.printf("  wifi%d (nrf%d): %d\n", w, nc, acc[nc]); }
                }
                nrf.end();
                continue;
            }
            else if (!strcmp(buf, "stat")) { Serial.printf("[stat] st=%d wifiGen=%u bleGen=%u scanIdle=%d heap=%u largest=%u\n",
                                             (int)st, (unsigned)engine.wifiGen(), (unsigned)engine.bleGen(),
                                             (int)engine.isIdle(), (unsigned)ESP.getFreeHeap(), (unsigned)ESP.getMaxAllocHeap()); continue; }
            else if (!strncmp(buf, "otafail", 7)) {            // QA: render each full-screen OTA error without a real failure
                static const struct { OtaManager::Err e; int code; const char* d; OtaManager::Phase ph; } S[] = {
                    { OtaManager::E_NONET,     0,   "wifi not connected (wl=3)",              OtaManager::CHECKING },
                    { OtaManager::E_TIME,      0,   "no NTP time (epoch=42)",                 OtaManager::CHECKING },
                    { OtaManager::E_API,       -1,  "conn: connection refused",              OtaManager::CHECKING },
                    { OtaManager::E_PARSE,     200, "IncompleteInput: stream ended mid-object", OtaManager::CHECKING },
                    { OtaManager::E_RATELIMIT, 403, "",                                       OtaManager::CHECKING },
                    { OtaManager::E_HASH,      0,   "",                                       OtaManager::DOWNLOADING },
                    { OtaManager::E_HTTP,      404, "download HTTP 404",                      OtaManager::DOWNLOADING },
                    { OtaManager::E_NOMEM,     0,   "no RAM for OTA task",                    OtaManager::CHECKING },
                };
                int n = (buf[7] == ' ') ? atoi(buf + 8) : 0;
                if (n < 0 || n >= (int)(sizeof(S) / sizeof(S[0]))) n = 0;
                if (!ota.simulateFail(S[n].e, S[n].code, S[n].d, S[n].ph)) { Serial.println("[cmd] otafail ignored — OTA busy"); continue; }
                if (st == ST_DEAUTH)      detector.stop();     // same teardown launch() does — don't strand the radio
                if (st == ST_CHANNELS)    airtime.stop();
                if (st == ST_SPECTRUM)    spectrumStop();      // also stops any TX carrier
                if (st == ST_SUBSPECTRUM) subStop();
                if (st == ST_SUBTX)     { subTxOn = false; cc.end(); }
                if (st == ST_SUBREC || st == ST_KEYBOARD || st == ST_REC_PLAY || st == ST_SUBHUNT) cc.end();
                if (st == ST_SUBCFG)      subcfg.stop();
                if (st == ST_POLITE)      portal.stop();
                if (st == ST_PROVISION)   net.stopProvision();
                engine.pause();
                st = ST_OTA; seenOtaGen = ota.gen(); seenOtaPhase = (int)ota.phase(); drawOtaScreen();
            }
            else if (!strcmp(buf, "menu"))   { if (ota.busy()) continue;
                                               if (st == ST_DEAUTH) detector.stop();
                                               if (st == ST_CHANNELS) airtime.stop();
                                               if (st == ST_SPECTRUM) spectrumStop();
                                               if (st == ST_SUBSPECTRUM) subStop();
                                               if (st == ST_SUBTX) { subTxOn = false; cc.end(); }
                                               if (st == ST_SUBREC || st == ST_KEYBOARD || st == ST_REC_PLAY || st == ST_SUBHUNT) cc.end();
                                               if (st == ST_SUBCFG) subcfg.stop();
                                               if (st == ST_POLITE) portal.stop();
                                               if (st == ST_PROVISION) net.stopProvision();
                                               depth = 0; showMenu(); }
            else { Serial.printf("[cmd] ? '%s'\n", buf); continue; }
            Serial.printf("[cmd] %s -> st=%d\n", buf, (int)st);
        } else if (len < sizeof(buf) - 1) {
            buf[len++] = c;
        }
    }
}

void setup() {
    Serial.begin(115200);
    delay(200);
    displayInit();
    uiBacklightBegin();              // apply saved screen brightness before anything is drawn
    BootScreen().show();
    delay(1500);
    i18n::set(loadLang());
    buttons.begin();
    touchBegin();                    // loads NVS calibration, or calibrates once
    net.begin();
    revealer.begin();                // load saved revealed hidden-SSID names from NVS
    wifiScreen.attachNet(&net);      // so the scanner can mark your own network (*)
    engine.attachRevealer(&revealer);// passively reveal hidden SSIDs during Wi-Fi scans
    engine.begin();                  // background scan task
    ota.begin(&engine, &net);        // OTA needs the radio (pauses scan) and the connection
    leds.begin();                    // status LEDs under the antennas
    nrf.setTxPower(loadTxPower());    // apply the saved Spectrum TX power (default max)
    nrf.setTxListenSelf(loadTxMode()); // apply the saved TX mode (Verify keeps the waterfall live)
    spTraffic = loadSpView();          // apply the saved spectrum view (occupancy / traffic)
    subPwrIdx = loadSubPower(); cc.setTxPower(CC_PA[subPwrIdx]);   // saved Sub-GHz TX power (default max)
    loadSubCfg();                      // saved Sub-GHz recorder settings (wait/freq/threshold/repeats/mod/invert)
    if (!RecStore::begin()) Serial.println("[rec] LittleFS mount failed — saved captures unavailable");
    if (!legalSeen()) { st = ST_LANGPICK; drawLangPick(); }   // first run: language, then the notice
    else showMenu();
}

void loop() {
    // ---- touch (edge-triggered) ----
    uint16_t tx, ty;
    if (touchGet(tx, ty)) {
        if (!touchDown) {
            touchDown = true;
            if (st == ST_LANGPICK) {
                for (int i = 0; i < 2; i++)
                    if (ty >= 120 + i * 48 && ty < 120 + i * 48 + 34) {
                        langPickSel = i; Lang l = i ? Lang::RU : Lang::EN;
                        i18n::set(l); saveLang(l); gotoLegal(true); break;
                    }
            } else if (st == ST_LEGAL) {
                if (ty > 260) { int m = legN - LEG_LINES; if (m < 0) m = 0;   // tap low = scroll on
                                if (legOff < m) { legOff += 4; if (legOff > m) legOff = m; drawLegalScreen(); }
                                else if (legFirstRun && legAccepted) { legalMarkSeen(); legFirstRun = false; depth = 0; showMenu(); }
                                else if (!legFirstRun) showMenu(); }
                else if (ty < 60 && legOff > 0) { legOff -= 4; if (legOff < 0) legOff = 0; drawLegalScreen(); }
            } else if (st == ST_MENU) {
                int hit = menuScreen.hitTest(tx, ty);
                if (hit >= 0) { int p = curSel(); curSel() = hit; menuScreen.repaint(p, hit); activate(); }
            } else if (st == ST_CONN) {
                if (ty < 28) back();
                else for (int i = 0; i < connActN; i++)
                    if (ty >= connActY[i] && ty < connActY[i] + 34) { connSel = i; connActivate(); break; }
            } else if (st == ST_HIDDEN) {
                if (ty < 28) back();
                else for (int i = 0; i < HID_VISIBLE; i++)
                    if (hidRowY[i] >= 0 && ty >= hidRowY[i] && ty < hidRowY[i] + HID_ROW_H) { hidSel = hidOff + i; openHiddenOptions(); break; }
            } else if (st == ST_OPTIONS) {
                if (ty < 28) back();
                else for (int i = 0; i < optN; i++)
                    if (ty >= optY[i] && ty < optY[i] + 34) { optSel = i; optActivate(); break; }
            } else if (st == ST_WIFI) {
                if (ty < 28) back();
                else { int i = (ty - UI_LIST_TOP) / UI_ROW_H; int idx = off + i;
                       if (i >= 0 && i < UI_VISIBLE && idx < engine.wifiCount()) { wifiSel = idx; ensureWifiVisible(); openNetOptions(); } }
            } else if (st == ST_OTA) {
                if (ota.phase() == OtaManager::AVAILABLE) ota.startUpdate();
                else if (ota.phase() != OtaManager::DOWNLOADING && ty < 60) back();
            } else if (st == ST_CONFIRM) {
                if (ty >= okBtnY && ty < okBtnY + 40) doConfirm();
                else if (ty >= cancelBtnY && ty < cancelBtnY + 40) cancelConfirm();
                else if (ty < 28) cancelConfirm();
            } else if (ty < 28) {           // WIFI / BLE / INFO / PROVISION: tap header to go back
                back();
            }
        }
    } else {
        touchDown = false;
    }

    // ---- keypad + serial remote ----
    onKey(buttons.poll());
    serialControl();

